# Pandas Exercise: Merging (MPG Cars)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [3]:
cars1=pd.read_csv("Pandas Exercise6 files/cars1.csv")
cars2=pd.read_csv("Pandas Exercise6 files/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [4]:
cars1=cars1.dropna(axis=1)
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [5]:
cars1.shape[0]

198

In [6]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [7]:
print(cars1.columns,'\n',cars2.columns)
cars=cars1.append(cars2)
cars.head()

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')
 Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [8]:
import numpy as np
s=np.random.randint(15000,73000,398)
s

array([34967, 44450, 71811, 67790, 20458, 26623, 67744, 69690, 47017,
       40703, 64091, 27979, 43727, 22769, 72917, 40397, 21572, 67305,
       70106, 56325, 38520, 30818, 21287, 58298, 61691, 46080, 65289,
       48355, 53824, 25318, 15169, 59206, 63889, 66758, 23288, 30561,
       36537, 41120, 27399, 36509, 35148, 38139, 16583, 51095, 50330,
       67618, 36479, 50543, 38250, 44857, 48567, 65703, 60281, 16789,
       71891, 28749, 56117, 61048, 23501, 35911, 68127, 46693, 63597,
       15556, 53390, 58418, 19930, 47212, 37171, 43873, 70959, 17663,
       50545, 29406, 44289, 65487, 39637, 58336, 31340, 40000, 54983,
       70246, 48659, 31145, 69282, 28810, 20191, 55227, 61298, 41636,
       33131, 43255, 51961, 34093, 20991, 57988, 63760, 48300, 22147,
       65964, 36874, 67112, 34058, 53644, 28314, 17988, 52403, 56322,
       66471, 57526, 40069, 26492, 65446, 28804, 56733, 66396, 71780,
       64936, 48948, 59316, 60097, 49553, 24404, 34726, 18620, 54245,
       23770, 20344, 57901, 63623, 62698, 29344, 33297, 60268, 45832,
       57752, 17789, 64866, 19373, 40425, 68889, 47287, 59506, 65733,
       39387, 48073, 68708, 16514, 45023, 21558, 56243, 39663, 61309,
       38306, 29052, 26775, 27100, 26158, 42563, 42211, 29988, 56985,
       20154, 58574, 34985, 43163, 72046, 47656, 64116, 71129, 24947,
       39100, 27388, 62493, 17788, 33995, 59415, 31136, 56985, 21608,
       60817, 67218, 34967, 56343, 29315, 57358, 34980, 33851, 52480,
       57302, 40434, 55519, 31682, 57406, 35721, 50399, 37967, 41058,
       16736, 32150, 55573, 69906, 18027, 60897, 40222, 53346, 35013,
       36340, 72682, 36555, 50668, 22039, 32491, 42537, 17142, 63439,
       60358, 30921, 61185, 15727, 16137, 58005, 72824, 23719, 60615,
       51904, 49425, 54440, 30579, 28056, 15113, 26757, 58964, 23463,
       20351, 37900, 35122, 22654, 17117, 70014, 69291, 66985, 48250,
       71609, 50749, 35446, 52491, 29193, 18393, 64637, 28812, 61275,
       39993, 64154, 24757, 72571, 58500, 71320, 17192, 20769, 69014,
       35378, 71527, 62754, 71329, 65172, 68477, 33730, 28562, 51488,
       66839, 35792, 51620, 25422, 72385, 27406, 15454, 48613, 67887,
       53632, 34505, 38531, 16369, 30988, 59603, 62436, 41369, 67844,
       60606, 71407, 51089, 49750, 41653, 16339, 31477, 70974, 19769,
       35846, 23516, 65389, 33066, 47950, 30035, 45249, 28133, 27840,
       47667, 15380, 68168, 62272, 23976, 41898, 44280, 55112, 24678,
       16352, 25840, 57131, 28619, 65935, 49522, 49943, 52606, 20958,
       56399, 20289, 15295, 21573, 60121, 24332, 57750, 45970, 47042,
       30290, 43179, 64395, 64250, 64266, 54211, 24119, 69711, 45827,
       35505, 20407, 25082, 33177, 16287, 60901, 38146, 71205, 46574,
       17292, 39261, 68436, 70475, 64656, 42989, 16987, 58899, 29524,
       19838, 72491, 46014, 58419, 41957, 15240, 70152, 45242, 35323,
       55395, 45985, 49657, 55874, 47503, 62677, 40228, 66654, 42638,
       34821, 23263, 63584, 22173, 26997, 33773, 44518, 51194, 38535,
       35796, 57599, 39050, 19577, 22526, 57235, 58760, 42963, 23077,
       70329, 49029])

### Step 8. Add the column owners to cars

In [9]:
cars['Owners']=s

In [10]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,34967
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,44450
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,71811
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,67790
4,17.0,8,302,140,3449,10.5,70,1,ford torino,20458